app/views/bookshelves/index.html.erb

      <div class="books">
        <% bookshelf_books = BookshelfContain.where(name: bookshelf.name, creator: bookshelf.creator) %>
        <% bookshelf_books.each do |bookshelf_book| %>
          <% book = Book.find_by(isbn: bookshelf_book.book) %>
---
SELECT "bookshelf_contains".* FROM "bookshelf_contains" WHERE "bookshelf_contains"."name" = 'Fantasy Collection' AND "bookshelf_contains"."creator" = 'AntonioTurco@example.com'
SELECT "books".* FROM "books" WHERE "books"."isbn" = '9780618640157' LIMIT 1

      <div class="bookshelf-footer">
        <% user = User.find_by(email: bookshelf.creator) %>
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'AntonioTurco@example.com' LIMIT 1