app/views/users/show.html.erb

      </h2>
      <% @user_posts = Post.where(creator: @user.email_address) %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."creator" = 'AntonioTurco@example.com'