app/views/posts/index.html.erb

    <div class="post">
      <% book = Book.find_by(isbn: post.book) %>
---
SELECT "books".* FROM "books" WHERE "books"."isbn" = '9780553381689' LIMIT 1

        <p><%= post.text %></p>
        <% user = User.find_by(email: post.creator) %>
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'AntonioTurco@example.com' LIMIT 1