app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.isbn.present?
---
SELECT 1 AS one FROM "books" WHERE "books"."isbn" = '9788854165052' LIMIT 1