app/controllers/books_controller.rb

  def index
    @books = if params[:isbn].present?
              Book.where("isbn LIKE ?", "#{params[:isbn]}%")
    else
              Book.all
---
SELECT "books".* FROM "books"

  def show
    @book = Book.find_by(id: params[:id])
    unless @book
      api_data = BookApiService.fetch_by_isbn(params[:id])
      if api_data[:error]
        flash[:alert] = "Book not found."
        redirect_to books_path
      else
        @book = Book.create!(isbn: params[:id], title: api_data[:title], cover_url: api_data[:cover_url])
---
SELECT "books".* FROM "books" WHERE "books"."id" = 4 LIMIT 1
INSERT INTO "books" ("isbn", "created_at", "updated_at", "title", "thumbnail") VALUES ('9788854165052', '2025-02-26 14:27:00.816191', '2025-02-26 14:27:00.816191', NULL, NULL) RETURNING "id"

  def create
    @book = Book.new(book_params)
    if @book.isbn.present?
      book_details = BookApiService.fetch_book_details(@book.isbn)
      @book.title = book_details[:title] if book_details[:title].present?
      @book.thumbnail = book_details[:thumbnail] if book_details[:thumbnail].present?
      @book.cover = book_details[:cover] if book_details[:cover].present?
      @book.poster = book_details[:poster] if book_details[:poster].present?
    end

    if @book.save
---
SELECT 1 AS one FROM "books" WHERE "books"."isbn" = '2' LIMIT 1
SELECT 1 AS one FROM "books" WHERE "books"."isbn" = '9780345513588' AND "books"."id" != 14 LIMIT 1
INSERT INTO "books" ("isbn", "created_at", "updated_at", "title", "thumbnail") VALUES ('9788854165052', '2025-02-26 14:27:00.816191', '2025-02-26 14:27:00.816191', NULL, NULL) RETURNING "id"

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = '2025-02-27 10:36:40.412044', "title" = 'cazzo' WHERE "books"."id" = 14

    def set_book
      @book = Book.find(params.expect(:id))
---
SELECT "books".* FROM "books" WHERE "books"."id" = 17 LIMIT 1