app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 71 LIMIT 1
---
    def set_post
      @post = Post.find(params.expect(:id))