app/controllers/users_controller.rb

  def make_admin
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1