app/controllers/utentes_controller.rb

SELECT "utentes".* FROM "utentes"
---
  def index
    @utentes = Utente.all

INSERT INTO "utentes" ("email", "nome", "created_at", "updated_at") VALUES ('Sanremone@ariston', 'Amadeus', '2025-02-24 16:22:51.530830', '2025-02-24 16:22:51.530830') RETURNING "id"
---
  def create
    @utente = Utente.new(utente_params)
    if @utente.save

UPDATE "utentes" SET "email" = 'amadeo@gmail.com', "updated_at" = '2025-02-24 16:33:37.476549' WHERE "utentes"."id" = 6
---
  def update
    if @utente.update(utente_params)

DELETE FROM "utentes" WHERE "utentes"."id" = 6
---
  def destroy
    @utente.destroy

SELECT "utentes".* FROM "utentes" WHERE "utentes"."id" = 2 LIMIT 1
---
    def set_utente
      @utente = Utente.find(params[:id])